Revit 2024 API
ConfigurationReloadInfo.GetConnectivityValidation Method
 Returns information about the post-reload connectivity validation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public ConnectionValidationInfo GetConnectivityValidation()
Visual Basic
Public Function GetConnectivityValidation As ConnectionValidationInfo
Visual C++
public:
ConnectionValidationInfo^ GetConnectivityValidation()
Return Value
 Information about the post-reload connectivity validation.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
See Also
ConfigurationReloadInfo Class
Autodesk.Revit.DB Namespace